; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	spectrograph4 - mode
	infrared2 - mode
	image3 - mode
	spectrograph0 - mode
	image1 - mode
	GroundStation0 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation11 - direction
	Star14 - direction
	Star5 - direction
	GroundStation13 - direction
	Star4 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	GroundStation12 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation12)
	(supports instrument1 image1)
	(supports instrument1 spectrograph4)
	(supports instrument1 image3)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation13)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation13)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(have_image Star15 spectrograph0)
	(have_image Star16 image3)
	(have_image Phenomenon17 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation13 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 groundstation13)
   goals met: 0 of 3
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
3. (calibrate satellite1 instrument3 groundstation13)
   added: (calibrated instrument3)
   goals met: 0 of 3
4. (turn_to satellite1 phenomenon17 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 3
5. (take_image satellite1 phenomenon17 instrument3 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 1 of 3
6. (turn_to satellite1 star15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star15)
   goals met: 1 of 3
7. (take_image satellite1 star15 instrument3 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 2 of 3
8. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 2 of 3
9. (take_image satellite1 star16 instrument3 image3)
   added: (have_image star16 image3)
   goals met: 3 of 3
